Repository: DiegoCorrea/Exploiting-Personalized-Calibration-and-Metrics-for-Fairness-Recommendation
Catalog: locales/*/LC_MESSAGES/*.po
Languages: pt

source: + Load the Data Set
pt: + Carregando base de dados

source: - Movielens Selected
pt: - Movielens selecionado

source: - OMS Selected
pt: - OMS selecionado

source: Parsing Data Set
pt: Analisando a base de dados

source: - - Analyzing the Popularity
pt: - - Analisando a popularidade

source: - - Analyzing the Genres
pt: - - Analisando os gêneros

source: UserKNN - Start
pt: UserKNN - Iniciado

source: User profile size
pt: Tamanho do perfil do usuário

source: Number of popular items
pt: Número de itens populares

source: Number of unpopular items
pt: Número de itens não populares

source: Number of users
pt: Número de usuários

source: Percentage of popular items
pt: Porcentagem de itens populares

source: Percentage of unpopular items
pt: Porcentagem de itens não populares

source: Number of items
pt: Número de itens

source: In users profiles
pt: No perfil do usuário

source: Niche
pt: Nicho

source: Focused
pt: Focado

source: Diverse
pt: Diverso

source: Explorer
pt: Explorador

source: Common
pt: Comum

source: Loyal
pt: Leal

source: Popularity
pt: Popularidade

source: Number of genres
pt: Número de gêneros

source: Groups of users
pt: Grupos de usuários

source: Popularity Ratio
pt: Taxa de popularidade

source: Recommendation Frequency
pt: Frequência da recomendação

source: Algorithm
pt: Algoritimo

source: Algorithms
pt: Algoritmos

source: UserKNN - Transform data
pt: UserKNN - Transformando dados

source: UserKNN - Evaluate
pt: UserKNN - Avaliando

source: UserKNN - Stop
pt: UserKNN - Finalizado

source: ItemKNN - Start
pt: ItemKNN - Iniciado

source: ItemKNN - Transform data
pt: ItemKNN - Transformando dados

source: ItemKNN - Evaluate
pt: ItemKNN - Avaliando

source: ItemKNN - Stop
pt: ItemKNN - Finalizado

source: SVD - Start
pt: SVD - Iniciado

source: SVD - Transform data
pt: SVD - Transformando dados

source: SVD - Evaluate
pt: SVD - Avaliando

source: SVD - Stop
pt: SVD - Finalizando

source: SVD++ - Start
pt: SVD++ - Iniciado

source: SVD++ - Transform data
pt: SVD++ - Transformando dados

source: SVD++ - Evaluate
pt: SVD++ - Avaliando

source: SVD++ - Stop
pt: SVD++ - Finalizado

source: NMF - Start
pt: NMF - Iniciado

source: NMF - Transform data
pt: NMF - Transformando dados

source: NMF - Evaluate
pt: NMF - Avaliando

source: NMF - Stop
pt: NMF - Finalizado

source: Top N items
pt: Melhores N itens

source: Distance value
pt: Valores da distância

source: + Evaluate
pt: Avaliando

source: Mining preferences
pt: Minerando preferências

source: Creating Fold
pt: Criando partição

source: Saving train set
pt: Salvando conjunto de treinamento

source: Saving test set
pt: Salvando conjunto de teste

source: Split into train and test
pt: Particionando em treinamento e teste

source: Fold
pt: Partição

source: Mining Items
pt: Minerando itens

source: Total of users
pt: Total de usuários

source: Merge preferences into df
pt: Mesclando as preferencias em dataframe

source: Done
pt: Feito

source: Pos Processing - Start
pt: Etapa de Pos processamento - Iniciada

source: Pos Processing - Stop
pt: Etapa de Pos processamento - Finalizada

source: Make list at:
pt: Criando lista ate:

source: Slope One - Start
pt: Slope One - Iniciado

source: Slope One - Transform Data
pt: Slope One - Transformando dados

source: Slope One - Evalluate
pt: Slope One - Avaliando

source: Slope One - Stop
pt: Slope One - Finalizando

source: Calibration
pt: Calibragem

source: Preference
pt: Preferências

source: Recommendation
pt: Recomendação

source: Linear Calibration
pt: Calibragem Linear
